import React, {useState} from "react";
import Image from "next/image";

import img1 from "../../../../public/section1/1.jpg";
import img2 from "../../../../public/section1/3.jpg";

import "./Batarea.scss";

const batarea = () => {

  return (
    <section id="section1" className="container container__batarea">
      <h2 className="h2">
        Мощная батарея и экономичный расход заряда позволяют преодолевать
        расстояния до 45 км
      </h2>
      <svg
        className="svg-3"
        width="1030"
        height="1391"
        viewBox="0 0 1030 1391"
        fill="none"
        xmlns="http://www.w3.org/2000/svg"
      >
        <g opacity="0.5" filter="url(#filter0_f_0_123)">
          <ellipse
            cx="317.91"
            cy="709.732"
            rx="429.732"
            ry="431.91"
            transform="rotate(90 317.91 709.732)"
            fill="url(#paint0_linear_0_123)"
          />
        </g>
        <defs>
          <filter
            id="filter0_f_0_123"
            x="-394"
            y="0"
            width="1423.82"
            height="1419.46"
            filterUnits="userSpaceOnUse"
            colorInterpolationFilters="sRGB"
          >
            <feFlood floodOpacity="0" result="BackgroundImageFix" />
            <feBlend
              mode="normal"
              in="SourceGraphic"
              in2="BackgroundImageFix"
              result="shape"
            />
            <feGaussianBlur
              stdDeviation="140"
              result="effect1_foregroundBlur_0_123"
            />
          </filter>
          <linearGradient
            id="paint0_linear_0_123"
            x1="-73.6992"
            y1="512.798"
            x2="402.678"
            y2="786.643"
            gradientUnits="userSpaceOnUse"
          >
            <stop stopColor="#FC501F" />
            <stop offset="1" stopColor="#FC501F" stopOpacity="0" />
          </linearGradient>
        </defs>
      </svg>
      <div className="section__container">
        <div className="card">
          <h4 className="h4">Три режима скорости</h4>
          <div className="line"></div>
          <p className="predlog">
            Три режима езды позволяют почуствовать себя комфортно в любой
            ситуации. Режим «S» увеличитвает скорость, если опаздываете на
            работу. Во время прогулки по парку активируйте режим «D». Включите
            режим «Пешеход», когда двигаетесь по оживлённой улице.
          </p>
        </div>
        <div className="line__card"></div>
        <div className="card">
          <h4 className="h4">Система восстановления энергии</h4>
          <div className="line"></div>
          <p className="predlog">
            Во время торможения и движения по инерции система преобразовывает
            кинетическую энергию в электрическую, позволяя увеличить общий запас
            хода самоката.
          </p>
        </div>
        <div className="line__card"></div>
        <div className="card">
          <h4 className="h4">Мощная батарея</h4>
          <div className="line"></div>
          <p className="predlog">
            Самокат оснащен аккумулятором емкостью 12 800 мАч. Это позволяет
            преодолевать расстояния до 45 км без подзарядки.
          </p>
        </div>
      </div>
      <div className="section__container-img">
        <Image className="img-1" alt='img' src={img1} />
        <Image className="img-2" alt='img' src={img2} />
      </div>
      <svg
      className="svg-5"
        width="1440"
        height="341"
        viewBox="0 0 1440 341"
        fill="none"
        xmlns="http://www.w3.org/2000/svg"
      >
        <path
          d="M1510.8 92.3671C1482.92 27.7208 1409.72 -13.0666 1340.26 3.82297C1306.47 12.0726 1276.6 31.8334 1255.79 59.7139C1235.37 87.831 1226.61 122.757 1231.34 157.188C1235.71 190.365 1251.61 222.475 1277.4 244.16C1301.13 264.136 1334.87 274.367 1365.48 267.456C1397.22 260.215 1417.77 233.075 1419.2 201.004C1420.78 165.827 1403.3 131.718 1379.06 107.296C1353.51 81.6897 1318.2 65.402 1281.71 72.0996C1245.21 78.7972 1221.41 107.315 1215.96 143.288C1209.51 185.726 1226.24 226.086 1233.84 267.126C1240.43 303.096 1237.17 340.179 1224.39 374.442C1200.05 440.7 1143.34 496.319 1073.99 512.995C1036.05 522.119 991.771 520.178 959.352 496.358C929.842 474.673 917.367 435.691 924.545 400.301C931.802 364.561 959.177 338.275 994.662 330.84C1029.84 323.482 1068.02 335.266 1089.44 364.91C1109.98 393.312 1113.65 432.119 1102.4 464.889C1089.98 500.804 1058.94 527.089 1023.82 539.63C944.277 567.799 862.674 524.934 811.804 464.074C758.527 400.34 732.82 319.483 685.694 251.789C645.048 193.374 578.986 136.726 503.32 141.444C428.392 146.045 376.008 210.652 352.94 277.026C323.547 361.571 328.261 453.687 302.923 539.281C280.184 616.119 228.829 692.956 145.771 711.147C108.014 719.78 68.3802 710.891 37.9186 686.958C9.67004 664.749 -10.3134 630.019 -6.53015 593.25C-2.64978 555.2 25.5017 522.702 59.7064 507.462C100.449 489.33 149.225 495.271 188.163 515.228C250.849 547.396 290.642 617.283 290.642 687.307C290.487 769.969 231.273 836.479 165.813 879.596C129.474 903.513 90.1472 922.305 50.8981 940.923C48.3566 942.126 50.5684 945.892 53.1099 944.805C129.784 908.289 210.591 869.093 259.58 796.429C280.184 765.912 293.552 730.618 294.891 693.539C295.818 659.647 288.17 626.071 272.657 595.929C239.558 530.797 169.247 484.031 94.4933 493.562C58.6394 498.125 25.5016 517.383 5.55701 547.92C-13.2704 576.247 -16.2448 612.262 -2.32007 643.297C11.7073 674.553 39.7617 698.878 71.5607 710.875C105.319 723.63 142.725 720.057 175.572 706.177C251.238 674.184 292.757 598.763 312.042 522.508C322.945 479.468 327.834 435.342 333.558 391.39C339.572 345.089 346.925 297.779 366.385 254.915C382.236 219.971 406.604 187.648 439.276 166.972C472.778 145.774 513.788 140.057 551.805 151.286C632.34 174.582 682.784 248.159 719.996 318.241C758.081 389.954 792.635 468.034 861.626 515.83C893.503 537.922 931.472 552.715 970.624 552.948C1006.09 553.181 1042.04 541.61 1069.57 518.955C1096.09 497.347 1111.98 465.314 1113.13 431.11C1114.18 399.466 1102.59 366.58 1077.89 345.944C1053.2 325.307 1018.2 319.736 987.6 328.025C956.189 336.548 931.336 359.824 922.256 391.254C913.448 421.714 919.055 456.658 938.456 481.953C961.175 511.597 999.842 522.935 1035.89 522.275C1105.46 520.974 1168.73 478.731 1205.77 421.326C1224.45 392.651 1236.31 360.067 1240.42 326.084C1242.38 308.879 1242.07 291.49 1239.49 274.367C1235.94 250.78 1228.7 227.969 1223.75 204.673C1215.35 165.05 1214.69 114.091 1252.26 88.5426C1288.54 63.8489 1335.68 75.361 1367.11 102.132C1396.21 127.02 1418.31 165.711 1414.55 205.12C1412.76 223.717 1403.94 241.403 1388.57 252.43C1374.31 262.661 1356.38 266.019 1339.1 264.835C1259.45 259.011 1217.33 166.176 1241.41 96.0556C1254.14 59.0927 1284.58 29.5456 1320.47 14.7527C1356.52 -0.0688025 1397.14 1.01679 1432.34 17.7423C1465.72 33.4401 1492.26 60.7407 1507.02 94.5608C1508.14 97.1427 1511.9 94.9102 1510.8 92.3671Z"
          fill="#FF4C0D"
        />
      </svg>
      <svg className="svg-4" width="892" height="938" viewBox="0 0 892 938" fill="none" xmlns="http://www.w3.org/2000/svg">
        <g opacity="0.2" filter="url(#filter0_f_0_124)">
          <ellipse cx="571" cy="569.5" rx="289.5" ry="291" transform="rotate(-90 571 569.5)" fill="url(#paint0_linear_0_124)" />
        </g>
        <defs>
          <filter id="filter0_f_0_124" x="0" y="0" width="1142" height="1139" filterUnits="userSpaceOnUse" colorInterpolationFilters="sRGB">
            <feFlood floodOpacity="0" result="BackgroundImageFix" />
            <feBlend mode="normal" in="SourceGraphic" in2="BackgroundImageFix" result="shape" />
            <feGaussianBlur stdDeviation="140" result="effect1_foregroundBlur_0_124" />
          </filter>
          <linearGradient id="paint0_linear_0_124" x1="307.183" y1="436.816" x2="712.761" y2="688.421" gradientUnits="userSpaceOnUse">
            <stop stopColor="#FC1F1F" />
            <stop offset="1" stopColor="#FCCB1F" stopOpacity="0.31" />
          </linearGradient>
        </defs>
      </svg>
    </section>
  );
};

export default batarea;
